alefragnani.project-manager
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.github-vscode-theme
mathiasfrohlich.kotlin
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
bradlc.vscode-tailwindcss
github.copilot
github.copilot-chat
pkief.material-icon-theme
redhat.vscode-yaml
shopify.ruby-extensions-pack
shopify.ruby-lsp
sorbet.sorbet-vscode-extension
stylelint.vscode-stylelint
vscjava.vscode-gradle
vscodevim.vim
yoavbls.pretty-ts-errors
